const typingParagraphs = [
"Շաբաթը երկու անգամ, ընթրիքէն ետք կը խմբուէինք բակին մէջ, ծալլապատիկ նստած գետինը, խառն ի խուռն, բայց կատարեալ լռութեամբ։ Հանդիսաւոր պահ մըն էր։ Մայրիկը, բազմած աթոռի մը վրայ, ակնոցները քիթին, Ս. Գիրքէն ընթերցում կ'ընէր: Քովը, ուրիշ աթոռի մը վրայ, քարիւղի լապտերը եւ գաւազանը։",
"Կը սպասէինք որ խօսի, խնդայ եւ խնդացնէ։ Պատրաստ էինք խնդալու, անմիջապէս որ բան մը ըսէր։ Մեր երեւակայութիւնը հազար տեսակ յատկութիւններ տուած էր միշտ խնդացող մարդուն, մինչդեռ մեր դիմացը կեցողը լուրջ եւ մտածկոտ երեւոյթ մը ունէր, ճիշդ Հայրիկին նման սեւ հագուստով։ Յուսախաբութիւնը կատարեալ պիտի ըլլար, եթէ չըլլար քիթը: Փոքրերուս ուշադրութիւնը կեդրոնացած էր միայն անոր քիթին վրայ, իբրեւ խոստացուած զուարճութեան կարելի միակ աղբիւրը:",
"Քիչ խօսիլն ալ մեծ դեր կը խաղայ մարդու մը կարեւորութիւնը բազմապատկելու։ Նախ քիչ խօսողը կը խուսափի ամէն վայրկեան տխմարաբանութիւններ ըսելու վտանգէն, յետոյ իր խօսքերը աւելի արժէք կը ստանան իրենց սակաւութեանը համար։ Քաղաքատնտեսութեան մէջ մատուցումի ու խնդրանքի օրէնք կ'ըսեն ասոր, կարծեմ։ Ժողովներու եւ ընկերութեանց մէջ շատ խօսողներուն այնչափ ուշադրութիւն չենք դարձներ, որչափ անոնց, որոնք հազիւ երբեմն կը խօսին։ Իսկ շարժ ու ձեւով իր միտքը բացատրելու կերպը հիանալի միջոց մըն է յաջողութեան։",
"Ահա արեւը, որ դիմացի լերան կռնակէն մարը մտնելու վրայ է եւ որ վերջալոյսը կ'ապրի։ Օդը զով է, ու ամէն մարդ փախած ներս։ Պատշգամին վրայ մինակ եմ, ու աղուոր բան մը մինակը վայելողի եսասէր գոհունակութեամբ՝ կը դիտեմ արեւմուտքին վրայ տարածուող յարափոփոխ տեսարանը:",
"Հալած ոսկիի ու այրած նարինջի ծով մը կայ դիմացս, որուն մէջ, տեղ–տեղ, եզան արիւնի կարմիրով գետեր կը հոսին ու թուխ ամպերէ կազմուած կղզիներ կը ծփան: Յետոյ այդ ծովը երանգ կը փոխէ, կ՚առնէ արծաթի, բոցի ու փայլեցուած ոսկիի գոյն: Կղզիները կ'անհետին ու չես գիտեր ուրկէ, երեւան կ՚ելլեն տասնեակ մը գաճաճներ, որոնք այդ ծփուն ծովը զանազան տեղերէ ճեղքելով, ջրվէժներ կը կազմեն այնքա՛ն իրական, որ ուշադիր ունկընդրելով կ'ըսես․ ահա կը լսես անոնց մեծադղորդ շառաչը։",
"Կը փակէինք գիրքը, կը նայէինք իրարու աչքին մէջ եւ առանց բառ մը ըսելու կը թռէինք փողոց, ուր փոքրիկ ստահակներու ուժովցած նոր խումբերով կը ծեծէինք ու քարահալած կ՚ընէինք բոլոր թշնամի լաճերը, հաւատալով, որ պիտի յաջողէինք օր մը մեր քարերու հասողութեան կէտերով բնորոշուած սահմանները հասցնել մինչեւ Անի եւ հոն նստեցնել մէկ նոր հզօր թագաւոր, որ մեր գիւղացին ըլլալու էր անպատճառ, եւ վերաշինելու էր Անին...",
"Այս լուսաւորութեան վրայ կէս ժամ չանցաւ, եւ Աբիսողոմ աղային ներկայացաւ երիտասարդ մը, որ վաճառականի չէր նմաներ, սեղանաւորի ալ չէր նմաներ, արհեստաւորի ալ չէր նմաներ, գործաւորի ալ չէր նմաներ, եւ վերջապէս անանկ բանի մը կը նմանէր, որուն նմանը չկայ։ Հազիւ երեսուներկուտարեկան կը թուէր։ Կապոյտ աչերով, դեղին մազերով զարդարուած ըլլալով՝ ունէր նաեւ երկու մատ մօրուք, որ մայրաքաղաքիս մէջ կամ սգոյ նշան է եւ կամ չքաւորութեան։ Հագուստներն այնքան հին էին, որ հնախոյզները զանոնք գնելու համար մեծաքանակ գումար մը կուտային։",
"Բեռնակիրներն ո՛չ լսած եւ ոչ ալ տեսած էին Ծաղկի փողոցն, բայց քաջալերուելով կարգ մը մարդոցմէ, որոնք գիտնալ կը ձեւացունեն ինչ որ չեն գիտեր եւ որոնքք խիստ բազմաթիւ են մեր ազգին մէջ՝ համարձակած էին ըսել Աբիսողոմ աղային, թէ աղէկ գիտէին Ծաղկի փողոցը։",
"Ժամանակին, Հեռաւոր, շատ հեռաւոր երկրի մը մէջ կ'ապրէր գեղեցիկ, բայց հպարտ ու անձնասէր իշխան մը։ Ան ոչ ոք կը հաւնէր ու ոչ ոքի օգնութեան կը հասնէր: Գիշեր մը ծերունի մուրացկան մը կը թակէ անոր դուռը։ – Խնդրեմ, - կ'ըսէ մուրացկանը, - դուրսը սաստիկ ցուրտ է ու փոթորիկ. այս գիշեր զիս ձեր տունը կ'ընդունի՞ս։",
"Իշխանը արհամարհանքով կը նայի ծերունիին ու կը հրամայէ ծառաներուն. – Փակեցէք դուռը։ — Խնդրեմ, – կ'աղաչէ ծերունին, – մի' խաբուիր արտաքին երեւոյթէս, մի' մերժեր զիս. բարիքիդ փոխարէն քեզի կը նուիրեմ այս սիրուն վարդը: – Վարդը, ինչ պիտի ընեմ ես վարդը, – կ'ըսէ իշխանը ու դուրս կը վանէ ծերունին:",
"Մեծ Հայրիկը կը բնակէր գեղատեսիլ բնութեան գիրկը։ Կը սիրէր ապրիլ առանձին, քաղաքի ժխորէն հեռու, ու վայելել գիւղի ջինջ օդը։ — Բարի լո՛ւյս, -կ'ըսէ կինը մoտենալով անոր։ — Բարի լոյս: Ի՞նչ կ'ընէք այս կողմերը,-կը բացագանչէ մեծ Հայրիկը զարմացած: - Արփին բերած եմ։ Քանի մը օրէն հեռաւոր քաղաք մը պիտի մեկնիմ ու հոն աշխատիմ:",
"Արփին Հետս չեմ կրնար տանիլ: Հինգ տարիէ ի վեր ես կը խնամեմ զայն։ Հիմա կարգը քուկդ է։ — Ես փոքրիկներ խնամել չեմ գիտեր,- կ'ըսէ մեծ հայրիկը շփոթած: Կինը առանց կարեւորութիւն ընծայելու մեծ հայրիկին խօսքերուն արագ-արագ կը հեռանայ։ Մինչ այդ Արփին ուլիկներով տարուած՝ կանաչ դաշտերուն մէջ կը վազվզէր ու հմայուած շուրջը կը դիտէր։",
"- Ոհ, մե'ծ Հայրիկ, այս ինչ Հրաշալի տեղ է, -կ'ըսէ Արփին հրճուանքով։ Ես այսքան գեղեցիկ դաշտեր ու ծաղիկներ չեմ տեսած. այսքա'ն մաքուր ու անուշ օդ չեմ շնչած: Ինչ լաւ կ'ըլլար, եթէ մայրիկս ու Հայրիկս ալ ողջ ըլլային ու մեզի Հետ ապրէին: — Մի' նեղուիր, Արփի', ես քեզ առանձին չեմ ձգեր, – կ'ըսէ մեծ հայրիկը ու գաւաթ մը կաթ կ'երկարէ Արփիին։",
"- Ըմ, Հայրիկ, այս ինչ Համեղ կաթիկ է,- կ'ըսէ Արփին շրթունքները լիզելով: – Ասիկա մեր այծիկին կաթն է. ասոնք ալ անկէ պատրաստուած կարագն ու պանիրն են։ Կե՛ր, տես ինչքան համով է, - կը պնդէ մեծ հայրիկը։ Մեծ Հայրիկը ուրախ էր, շատ ուրախ էր Արփիին ներկայութեամբ։",
"Առաւօտ էր. ջինջ առաւօտ։ Արեւը «Բարի լոյս» կ'ըսէր ծառերուն, լեռներուն, թռչուններուն անոնք ժպտերես կը պատասխանէին. «Բարի լոյս»։ Զեփիւռը մեղմիկ կը փչէր։ Ծաղիկները ուրախ-զուարթ կը տատանէին ու չես գիտեր իրարու ինչեր կը փսփսային։",
"- Արփի, արա՛գ քալէ, – կ'ըսէր կինը, խօսքը ուղղելով փոքրիկ աղջկան։ - Յոգնեցայ, մօրաքոյր, ե՞րբ պիտի հասնինք մեծ Հայրիկիս տունը,- կը գանգատէր աղջկանը։ — Քիչ մնաց, հիմա կը հասնինք, – կը պատասխանէր մօրաքոյրը ու աւելի կ'արագացնէր քայլերը: Վերջապէս կը հասնին մեծ Հայրիկին տունը:",
"Ճիշդ այդ պահուն ծերունին կը վերածուի երիտասարդ կախարդուհիի մը. ձեռքի ճիպոտով կը կախարդէ իշխանը, պալատն ու պալատականները: Իշխանը կը վերածէ տգեղ ու ահռելի գազանի մը, պալատը` մռայլ ու լքուած դղեակի, իսկ պալատականները` խօսուն իրերու։ Վարդը, զոր առաջարկած էր տալ իշխանին, մոգական վարդ մըն էր։ Ան բացուած պիտի մնար, մինչեւ որ իշխանը քսանմէկ տարեկան ըլլար։",
"Անկէ ետք պիտի թոռմէր: Եթէ մինչեւ վերջին տերեւին իյնալը գազանը սիրէր մէկը ու սիրուէր անկէ, կախարդութիւնը պիտի վերանար պալատէն ու ամէն բան պիտի գտնէր իր նախկին վիճակը: Տարիներ կ'անցնին։ Գազանը ամօթահար իր տեսքէն, աւելի ու աւելի կ'ամփոփուի ինքն իր մէջ։ Ան վստահ էր, որ ոչ ոք այլեւս պիտի սիրէր զինք: Վարդը սկսած էր թոռմիլ:",
"Մշուշոտ օր մը ձիաւոր ծերունի մը անտառին մէջ ճամբան կը կորսնցնէ: Հոս կը սուրայ, Հոս կը սուրայ, ու հետզհետէ աւելի ու աւելի կը խորանայ անտառին մէջ։ Գիշեր կ'ըլլայ։ Գայլերը կ'ոռնան: Ձին կը խռոչի, ետ-ետ կ'երթայ։ Սարսափահար, ծերունին ապաստան մը կը փնտռէ: Յանկարծ հեռուն լոյս մը կը նշմարէ։ Կը փութայ այն կողմ: Դղեակ մը կը տեսնէ ու կը մտնէ ներս։",
"Բարե՛ւ, ո՞վ կը բնակի Հոս, - կը բացագանչէ ծերունին: -.... Պատասխան չ’ստանար: Հազիւ աթոռ մը կը ճարէ հանգստանալու, երբ դէմը կը ցցուին տարօրինակ արարածներ` կլորիկ թեյնիկ մը, երկարավիզ աշտանակ մը ու սիրունիկ ժամացոյց մը: — Բարո՛վ եկար, անծանօթ ծերունի, քեզի տաքուկ թէյ մը հրամցնե՞նք. -կ’ըսեն անոնք ժպտալով։",

"Առաւօտ կանուխ էր։ Արեւը նոր կը ծագէր լեռներուն ետեւէն, իսկ թռչունները ուրախ երգերով կը լեցնէին օդը։ Դաշտերուն վրայ ցօղի կաթիլները կը փայլէին արեւուն լոյսին տակ, եւ մեղմ զեփիւռ մը կը շարժէր խոտերն ու ծաղիկները։ Գիւղի մարդիկ արդէն սկսած էին իրենց օրուան աշխատանքը, մինչ բնութիւնը խաղաղ ու գեղեցիկ տեսարան մը կը ներկայացնէր։",

"Մանուկը գիրք մը առաւ ու նստաւ մեծ ծառի մը շուքին տակ։ Ան խոր հետաքրքրութեամբ կը կարդար պատմութիւնը եւ կը հետեւէր հերոսներուն արկածներուն։ Ամէն նոր էջ անոր առջեւ կը բանար նոր աշխարհ մը՝ լեցուն գիտելիքներով եւ երեւակայութեամբ։ Ժամանակը արագ կ'անցնէր, բայց ան այնքան տարուած էր ընթերցանութեամբ, որ չէր նկատեր ժամերու անցնիլը։",

"Գիւղին մէջ մարդիկ իրարու կը բարեւէին ջերմ ժպիտով եւ սիրալիր խօսքերով։ Երբ մէկը օգնութեան կարիք ունենար, դրացիները անմիջապէս պատրաստ կ'ըլլային աջակցելու։ Անոնք միասին կը կազմակերպէին տօներ, կը կիսուէին իրենց ուրախութիւններն ու դժուարութիւնները եւ կը պահպանէին համերաշխութեան ոգին։ Այդ պատճառով գիւղը խաղաղ ու բարեկամական վայր մըն էր բոլորին համար։",

"Անձրեւը մեղմիկ կը տեղար ամբողջ օրը, եւ երկինքը ծածկուած էր մոխրագոյն ամպերով։ Կաթիլները հանգիստ ձայնով կը զարնուէին պատուհաններուն, մինչ տան մէջ տաք ու յարմար մթնոլորտ կը տիրէր։ Ընտանիքի անդամները միասին նստած էին, կը զրուցէին եւ թէյ կը խմէին։ Դուրսի ցուրտ եղանակին հակառակ, տունը լեցուն էր ջերմութեամբ ու խաղաղութեամբ։",

"Փոքրիկ այգիին մէջ բազմաթիւ ծաղիկներ կը ծաղկէին ամէն գարուն։ Կարմիր, դեղին, ճերմակ եւ մանիշակագոյն ծաղիկները գեղեցիկ գոյներով կը զարդարէին ամբողջ տարածքը։ Թիթեռնիկները ծաղիկէ ծաղիկ կը թռչէին, իսկ մեղուները զբաղած կ'ըլլային նեկտար հաւաքելով։ Այգին կը դառնար հանգստութեան վայր մը, ուր մարդիկ հաճոյքով կու գային զբօսնելու եւ բնութիւնը վայելելու։",

"Երեկոյեան ընտանիքը մէկ սեղանի շուրջ կը հաւաքուէր ընթրիքի համար։ Օրուան ընթացքին պատահած դէպքերը կը պատմուէին, եւ բոլորը ուշադրութեամբ կը լսէին իրարու։ Երբեմն ծիծաղը կը լեցնէր ամբողջ սենեակը, իսկ երբեմն հետաքրքրական զրոյցներ կը սկսէին։ Այդ պահերը շատ արժէքաւոր էին, որովհետեւ ընտանիքի անդամները միասին ժամանակ կ'անցընէին եւ իրենց կապերը աւելի կը զօրացնէին։",

"Ծովափին ալիքները հերթաբար կու գային ու կը զարնուէին ափին։ Զով քամին կը փչէր ծովէն դէպի ցամաք եւ հաճելի թարմութիւն կը բերէր։ Մարդիկ կը զբօսնէին աւազին վրայ, երեխաները կը խաղային, իսկ ոմանք կը նստէին դիտելու հորիզոնին վրայ փայլող արեւը։ Ծովու ձայնը խաղաղութիւն կը ներշնչէր եւ կը մոռցնէր առօրեայի հոգերը։",

"Դպրոցին մէջ աշակերտները ուշադիր կը լսէին ուսուցչուհին, որ նոր դաս մը կը բացատրէր։ Ան պարզ ու հետաքրքրական օրինակներով կը ներկայացնէր նիւթը, որպէսզի բոլորը դիւրութեամբ հասկնան։ Երբ հարցումներ կը տրուէին, աշակերտները մեծ ոգեւորութեամբ կը փորձէին պատասխանել։ Դասարանը լեցուն էր հետաքրքրասիրութեամբ, եւ բոլորը պատրաստ էին նոր գիտելիքներ ձեռք բերելու։",

"Անտառին մէջ բարձր ծառերը կարծես կը դպչէին երկինքին։ Թռչուններու երգերը ամէն կողմէ կը լսուէին, իսկ փոքրիկ առուակը մեղմ ձայնով կը հոսէր ծառերուն միջեւ։ Երբ արեւուն ճառագայթները կը թափանցէին տերեւներուն արանքէն, գետինը կը լուսաւորուէր գեղեցիկ պատկերներով։ Բնութիւնը կեանքով ու գոյներով լեցուն էր, եւ ամէն քայլափոխի նոր հրաշք մը կարելի էր տեսնել։",

"Բարի խօսքը եւ ազնիւ վերաբերմունքը մեծ արժէք ունին մարդկային յարաբերութիւններուն մէջ։ Երբ մարդը յարգանքով, համբերութեամբ եւ սիրով կը մօտենայ ուրիշներուն, վստահութիւնը կը մեծնայ եւ բարեկամութիւնը կը խորանայ։ Փոքրիկ բարի գործ մը կամ քաջալերական խօսք մը երբեմն կրնայ ամբողջ օր մը աւելի լուսաւոր դարձնել։ Այդ պատճառով անհրաժեշտ է միշտ փորձել բարութիւն սփռել մեր շրջապատին մէջ։"
];


const targetWords = [
    "ԱՐՄԱՏ"
];

const ztypeWords = {
    easy: [
        "արեւ", "ջուր", "հող", "տուն", "սար",
        "Քար", "բառ", "երգ", "պար", "քուն",
        "մեծ", "լաւ", "սեւ", "նոր", "հին",
        "տաք", "ծով", "ծառ", "կրակ", "աչք",
        "ձեռք", "գլուխ", "սիրտ", "հոգի",
        "լոյս", "խաչ", "յոյս", "փառք",
        "ազգ", "հայ"
    ],
    medium: [
        "լուսին", "աստղ", "ծաղիկ",
        "գիրք", "գրիչ", "դպրոց",
        "մայր", "հայր", "քոյր",
        "ընկեր", "ժպիտ", "նկար",
        "կապոյտ", "կանաչ",
        "դեղին", "սպիտակ",
        "արագ", "դրոշ", "սեւան",
        "գառնի", "Մասիս",
        "Տաթեւ", "Արցախ",
        "Շուշի"
    ],
    hard: [
        "երկինք", "ճանապարհ",
        "ընտանիք", "եղբայր",
        "կարմիր", "գեղեցիկ",
        "ուժեղ", "խելացի",
        "անկախ", "ազատ",
        "խաղաղութիւն",
        "ուրախութիւն",
        "պատմութիւն",
        "մշակոյթ",
        "արուեստ",
        "գիտութիւն",
        "կրթութիւն",
        "հաւատք",
        "եկեղեցի",
        "Յաղթանակ"
    ]
};

const typingWords = [
    "արեւ", "լուսին", "աստղ", "երկինք", "ջուր", "հող", "կրակ", "ծառ", "ծաղիկ", "սար", "քար", "ճանապարհ",
    "գիրք", "գրիչ", "դպրոց", "տուն", "ընտանիք", "հայր", "մայր", "քույր", "եղբայր", "ընկեր", "սեր",
    "խաղաղութիւն", "ուրախութիւն", "ժպիտ", "աչք", "ձեռք", "ոտք", "գլուխ", "սիրտ", "հոգի", "միտք",
    "բառ", "խոսք", "ձայն", "երգ", "պար", "նկար", "գույն", "կարմիր", "կապույտ", "կանաչ", "դեղին",
    "սպիտակ", "սեւ", "մեծ", "փոքր", "լաւ", "վատ", "արագ", "դանդաղ", "տաք", "ցուրտ", "նոր", "հին",
    "գեղեցիկ", "ուժեղ", "խելացի", "բարի", "ազատ", "անկախ", "հայ", "հայաստան", "երեւան", "արարատ",
    "մասիս", "սեւան", "գառնի", "գեղարդ", "տաթեւ", "արցախ", "շուշի", "դրոշ", "զինանշան", "օրհներգ",
    "պատմութիւն", "մշակոյթ", "արվեստ", "գիտութիւն", "կրթութիւն", "հավատք", "եկեղեցի", "խաչ",
    "աղօթք", "հույս", "լույս", "ճշմարտութիւն", "արդարութիւն", "ազատութիւն", "հաղթանակ", "փառք",
    "պատիւ", "արժանապատվութիւն", "հայրենիք", "պետութիւն", "ազգ", "ժողովուրդ"
];



const PUZZLES = [
{
    mainWord: "ՔԱՂԱՔԱԿՐԹՈՒԹԻՒՆ",
    subWords: [
        "ՔԱՂԱՔ",
        "ԿՐԹՈՒԹԻՒՆ",
        "ՔԱՐ",
        "ԿԱԹ",
        "ԱՂ",
        "ՆԻՒԹ",
        "ԹԻՒ"
    ]
},
{
  mainWord: "ԱՇԽԱՐՀԱԳՐՈՒԹԻՒՆ",
  subWords: ["ԱՇԽԱՐՀ", "ԳՐՈՒԹԻՒՆ", "ՇԱՀ", "ԳԱՀ", "ԳԻՐ", "ԽԱՆ", "ՆԱԽ", "ՀՈՒՐ", "ՀԻՒԹ", "ՆՈՒՐ"]
},
{
  mainWord: "ԴԱՍԱՐԱՆ",
  subWords: ["ԴԱՍ", "ՍԱՐ", "ՍԱՐԴ", "ԴԱՆ", "ԴԱՐ", "ԴԱՐԱՆ"]
},
{
  mainWord: "ՀԻՒՐԱՍԵՆԵԱԿ",
  subWords: ["ՀԻՒՐ", "ՍԵՆԵԱԿ", "ՍԱՐ", "ԿԱՐ", "ԵԱՐ", "ՆԱՒ"]
},
{
  mainWord: "ԾՈՎԱՆԿԱՐԻՉ",
  subWords: ["ԾՈՎ", "ՆԿԱՐ", "ՆԿԱՐԻՉ", "ՎԱՆ", "ԿՈՎ", "ՎԱՐԻՉ"]
},
{
  mainWord: "ԾԱՂԿԱՄԱՆ",
  subWords: ["ԱՄԱՆ", "ԿԱՂ", "ՆԱՄԱԿ", "ԾԱՂ", "ԾԱԿ", "ԱՂ"]
},
{
  mainWord: "ՍԱՐԴԱՐԱՊԱՏ",
  subWords: ["ՍԱՐ", "ԴԱՐ", "ՊԱՏ", "ՍԱՐԴ", "ԴԱՍ", "ՊԱՐ"]
},
{
  mainWord: "ԾԻԾԵՌՆԱԿԱԲԵՐԴ",
  subWords: ["ԾԻԾԵՌՆԱԿ", "ԲԵՐԴ", "ԲԱՆԱԿ", "ԾԵՐ", "ԾԱԿ", "ԾԱՌ", "ԲԱԿ", "ԿԱՐ"]
},
{
  mainWord: "ԱՐՔԱՅԱԽՆՁՈՐ",
  subWords: ["ԱՐՔԱՅ", "ԽՆՁՈՐ", "ԽՈՐ", "ՆՈՐ", "ԱՐԱ", "ԽԱՆ", "ՁՈՐ", "ՔԱՐ"]
},
{
  mainWord: "ՀԵՌԱՏԵՍԻԼ",
  subWords: ["ՀԵՌԱՏԵՍ", "ՏԵՍԻԼ", "ՏԵՍ", "ՍԱՌ", "ՏԱՌ", "ՍԵՌ"]
},
{
  mainWord: "ՄԱՏԵՆԱԳԻՐ",
  subWords: ["ԳԻՐ", "ՄԱՏ", "ԱՏԵՆ", "ԱՐԱՏ", "ԱՐՄԱՏ", "ԱՐԱԳ"]
},
{
  mainWord: "ՄԱՏԵՆԱԴԱՐԱՆ",
  subWords: ["ՄԱՏ", "ԴԱՐ", "ԱՏԵՆ", "ԱՐՄԱՏ", "ԱՐԱՏ", "ՄԱՏԵԱՆ"]
},
{
  mainWord: "ԳՐԱՍԵՆԵԱԿ",
  subWords: ["ՍԵՆԵԱԿ", "ԳՐԱԿԱՆ", "ՆԿԱՐ", "ՍԱՐ", "ԳԱՐ", "ԱՐԱ"]
}

];


const wordleWords = {
    3: [
        "ՀԱՅ", "ՄԵԾ", "ՍԱՐ", "ԾՈՎ", "ՆՈՐ", "ՀԻՆ", "ՏԱՔ", "ԼԱՒ", "ՎԱՏ", "ՔԱՐ",
        "ԲԱՌ", "ԵՐԳ", "ՊԱՐ", "ԱՉՔ", "ԽԱՉ", "ԱԶԳ", "ՈՒԺ", "ՀԱՑ",
        "ՄԻՍ", "ՍԱՐ", "ՍԱՌ", "ԾԱՌ", "ԳԱՀ", "ԲԱԿ", "ՆԱՒ", "ԴԱՍ", "ԳԻՐ", "ԾՈՌ",
        "ՀՈՂ", "ՔԻԹ", "ՄԱԶ", "ԿՈՂ", "ՍԷՐ", "ԿԱՒ", "ՇՈՂ", "ԹԵԼ", "ԳԱՄ", "ՀՈՐ",
        "ԲԱՑ", "ԳՈՑ", "ԼԱՑ", "ՎԱՌ", "ՀՈՍ", "ՎԱՐ", "ԴՈՂ", "ՎԱԽ", "ԲԱՌ", "ՏԵՂ",
        "ԼԱՐ", "ԽԱՂ", "ՄԵԾ", "ՊԱՂ", "ՏԱՔ", "ՉՈՐ", "ԹԱՑ", "ՆՈՐ", "ՀԻՆ", "ԳԷՇ",
        "ԼԱՒ", "ՍԵՒ", "ՇԱՏ", "ՔԻՉ", "ՆԵՂ", "ՄՕՏ", "ՄԷԿ", "ՏԱՄ", "ԿԷՏ", "ՆԻՇ",
        "ՓՈՍ", "ԾԱԿ"
    ],
    5: [
        "ՄԱՍԻՍ", "ԳԱՌՆԻ", "ԱՐՑԱԽ", "ՇՈՒՇԻ", "ՍԵՒԱՆ", "ԱՐՄԱՏ", "ԵՐԿԻՐ", "ԸՆԿԵՐ",
        "ԿԱՆԱՉ", "ԴԵՂԻՆ", "ԴՊՐՈՑ", "ՍԱԼՈՐ", "ԽՆՁՈՐ", "ԽԱՂՈՂ", "ՄԱՏԻՏ", "ՍՐԲԻՉ",
        "ԱԿՆՈՑ", "ԲԱԺԱԿ", "ՍԵՂԱՆ", "ԹՈՒՂԹ", "ԳԱՒԱԹ", "ԴԱՆԱԿ", "ԿԱՏՈՒ", "ԿՐԵԱՅ",
        "ԾԱՂԻԿ", "ՇԱՊԻԿ", "ՔԱՆԱԿ", "ԿՕՇԻԿ", "ԿԱՊԻԿ", "ՊԱՆԱՆ", "ՍԱՆՏՐ", "ՇԱԲԱԹ",
        "ՏԱՓԱԿ", "ՏԱՐԱԶ", "ՏԱՊԱԿ", "ՏԱԲԱՏ", "ԳԱԳԱԹ", "ՏԵՐԵՒ", "ԿԵՐԱՍ", "ԳՆԴԱԿ",
        "ԳԱԶԱԿ", "ԾՈՐԱԿ", "ՎՐՁԻՆ", "ԲԺԻՇԿ", "ԱԿՌԱՅ", "ԵՂՆԻԿ", "ԱՔԼՈՐ", "ԱՐԻՒԾ",
        "ԹԹՈՒՄ", "ԼՈԼԻԿ", "ԱՆՈՒՇ", "ՄԻՋԱՏ", "ՍՈՒՐՃ", "ԱՐԾԻՒ", "ՈՉԽԱՐ", "ԿԱՆԱՉ",
        "ԿԱԿԱՉ", "ԴԵՂԻՆ", "ԱՂՕԹՔ", "ՍՈՒՐԲ", "ԱՐԾԱԹ", "ՄԵՏԱՂ", "ՀԱԼԷՊ", "ՎԶՆՈՑ",
        "ԸՆԿԵՐ", "ՄՈՒՐՃ", "ԱԿԱՆՋ", "ՌՈՒՆԳ", "ԿՈՃԱԿ", "ԱՐԻՒՆ", "ԽՈՒՆԿ", "ՋՂՋԻԿ",
        "ՀՆԴԻԿ", "ՃԿՈՒՆ", "ՃԿՈՅԹ", "ՊԶՏԻԿ", "ՄԿՐԱՏ", "ԿԵԱՆՔ", "ԿՏՈՒՑ", "ՔԱՂԱՔ",
        "ԱՇՈՒՆ", "ԲԱՐԵՒ", "ԱՆՈՒՆ", "ՀԱՑԻԿ", "ԿԱԹԻԼ"
    ],
    7: [
        "ԸՆՏԱՆԻՔ", "ԳԵՂԵՑԻԿ", "ՄԱՐԶԱՆՔ", "ԱՆԿՈՂԻՆ", 
        "ԱՍՏԻՃԱՆ", "ՀՈՎԱՆՈՑ", "ՁՄԵՌՈՒԿ", "ԼԻԲԱՆԱՆ",
        "ԸՆՁՈՒՂՏ", "ՈՒՏԵԼԻՔ", "ՊԱՀԱՐԱՆ", "ԱՂԲԱՄԱՆ",
        "ԵԿԵՂԵՑԻ", "ՅԻՇԱՏԱԿ", "ՋՐՀԵՂԵՂ", "ԲԱՑԱԿԱՅ",
        "ԹՈՒԱԿԱՆ", "ԸՆՏԱՆԻՔ", "ՊՏՂԱԲԵՐ", "ԳԵՂԵՑԻԿ",
        "ԿԱՐԵՒՈՐ", "ՀԻԱՆԱԼԻ", "ՀԱԳՈՒՍՏ", "ՔԱՅԼԵՐԳ",
        "ԱՇԽԱՏԻԼ", "ՃԱՇԱՐԱՆ", "ԳԱՂԱՓԱՐ", "ԼՐԱՑՆԵԼ",
        "ՎԵՐՑՆԵԼ", "ՀԱՒԱՔԵԼ", "ԱՇԱԿԵՐՏ", "ԳԼԽԱՒՈՐ",
        "ՇԱՐԺՈՒՆ", "ՏԵՍԱՐԱՆ", "ՍԱՏԱՆԱՅ", "ՎԻՐԱՒՈՐ",
        "ԿԵՆԴԱՆԻ", "ԿԱՏԱՐՈՂ", "ՄՈԼՈՐԱԿ", "ՇԵՂԱԳԻՐ",
        "ՁԵՌԱՅԻՆ", "ՇՐՋԱՆԱԿ", "ԳԻՒՂԱՑԻ", "ՀԱԿԱՌԱԿ",
        "ՎԻՄԱԳԻՐ", "ՆՈՏՐԳԻՐ", "ՏԻՐԱԿԱՆ", "ԽՈՅԱՆԱԼ",
        "ՈՍԿԵՐԻՉ", "ԾԻՍԱԿԱՆ", "ՊԵՏԱԿԱՆ", "ԱՍՏՈՒԱԾ",
        "ՍՐԲԱՏԱՇ", "ՎԻԹԽԱՐԻ", "ՄՇՏԱՎԱՌ", "ՄԱՂԱՔԻԱ",
        "ԵՐԵՑԿԻՆ", "ՏԱՆԵՐԷՑ", "ԾՈՎԱՀԷՆ", "ԾՈՎԱՅԻՆ",
        "ԹԱԳՈՒՀԻ", "ԹԱԳԱՒՈՐ", "ՈՒՇԱԴԻՐ", "ԱՇԱԿԵՐՏ",
        "ՕՐԱՑՈՅՑ", "ՄՇԱԿՈՅԹ", "ԳԵՂԵՑԻԿ"
    ]
};